app/views/members_projects/_form.html.erb

    <%= f.label :member_id %><br>
    <%= collection_select(:members_project, :member_id, Member.all, :id, :first_and_lastname, prompt: "Choose a Member", :multiple => false) %>
---
SELECT `members`.* FROM `members`
SELECT `projects`.* FROM `projects`