app/views/members_projects/index.html.erb

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 1 LIMIT 1
---
      <tr>
        <td><%= members_project.member.lastname + ',' + members_project.member.firstname %></td>