app/views/projects/_form.html.erb

SELECT `books`.* FROM `books`
---
	<%= f.label :book %>
	<%= collection_select(:project, :book_id, Book.all, :id, :name, {}, :multiple => false) %>