app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT `books`.* FROM `books`

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO `books` (`name`, `version`) VALUES ('The Professional Speaker', '1')

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE `books` SET `version` = '2' WHERE `books`.`id` = 2

  def destroy
    @book.destroy
---
DELETE FROM `books` WHERE `books`.`id` = 2

    def set_book
      @book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1