app/controllers/members_projects_controller.rb

SELECT `members_projects`.* FROM `members_projects`
---
  def index
    @members_projects = MembersProject.all

INSERT INTO `members_projects` (`member_id`, `project_id`, `date`) VALUES (1, 5, '2012-12-01 00:00:00.000000')
---
  def create
    @members_project = MembersProject.new(members_project_params)

    respond_to do |format|
      if @members_project.save

DELETE FROM `members_projects` WHERE `members_projects`.`id` = 2
---
  def destroy
    @members_project.destroy

SELECT  `members_projects`.* FROM `members_projects` WHERE `members_projects`.`id` = 2 LIMIT 1
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
---
    def set_members_project
      @members_project = MembersProject.find(params[:id])