app/controllers/members_controller.rb

SELECT `members`.* FROM `members`
---
  def index
    @members = Member.all

INSERT INTO `members` (`firstname`, `lastname`, `address1`) VALUES ('', '', '')
---
  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save

UPDATE `members` SET `address1` = '601 Jefferson Street' WHERE `members`.`id` = 1
---
  def update
    respond_to do |format|
      if @member.update(member_params)

DELETE FROM `members` WHERE `members`.`id` = 3
---
  def destroy
    @member.destroy

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 3 LIMIT 1
---
    def set_member
      @member = Member.find(params[:id])