app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
  def index
    @projects = Project.all

INSERT INTO `projects` (`name`, `book_id`) VALUES ('Project 1', 0)
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
---
    def set_project
      @project = Project.find(params[:id])