app/views/members/_form.html.erb

    <%= f.fields_for :projects do |builder| %>
    <%= builder.collection_select(:project_id, Project.all, :id, :name, prompt: "Select A Project") %>
---
SELECT `projects`.* FROM `projects`